{
  "peft_type": "LORA",
  "auto_mapping": null,
  "base_model_name_or_path": "meta-llama/Llama-3.2-1B-Instruct",
  "revision": null,
  "task_type": "CAUSAL_LM",
  "inference_mode": true,
  "r": 16,
  "target_modules": [
    "q_proj",
    "v_proj"
  ],
  "lora_alpha": 32,
  "lora_dropout": 0.1,
  "bias": "none",
  "modules_to_save": null
}